@ocofaigh We figured out why the PR test is failing due to consistency test reporting that the `ibm_container_addons.addons` requires an update following the plan (idempotent check).

The issue is with a change in the provider v1.53.0 and v1.54.0, probably part of this PR: https://github.com/IBM-Cloud/terraform-provider-ibm/pull/4408
When I upgrade the provider version of e-2-e example in `main` branch to v1.53.0, then follow with a plan, I get the following update from terraform:
```
  # module.ocp_all_inclusive.module.ocp_base.ibm_container_addons.addons will be updated in-place
  ~ resource "ibm_container_addons" "addons" {
        id                = "cicu0mmr021nefhes3dg"
      + manage_all_addons = true
      + managed_addons    = (known after apply)
        # (2 unchanged attributes hidden)

      + addons {
          + allowed_upgrade_versions = (known after apply)
          + deprecated               = (known after apply)
          + health_state             = (known after apply)
          + health_status            = (known after apply)
          + min_kube_version         = (known after apply)
          + min_ocp_version          = (known after apply)
          + name                     = "cluster-autoscaler"
          + options                  = (known after apply)
          + supported_kube_range     = (known after apply)
          + target_version           = (known after apply)
          + version                  = "1.0.8"
          + vlan_spanning_required   = (known after apply)
        }
      + addons {
          + allowed_upgrade_versions = (known after apply)
          + deprecated               = (known after apply)
          + health_state             = (known after apply)
          + health_status            = (known after apply)
          + min_kube_version         = (known after apply)
          + min_ocp_version          = (known after apply)
          + name                     = "vpc-block-csi-driver"
          + options                  = (known after apply)
          + supported_kube_range     = (known after apply)
          + target_version           = (known after apply)
          + version                  = "5.0"
          + vlan_spanning_required   = (known after apply)
        }

        # (1 unchanged block hidden)
    }
```

NOTE: when I try to `apply` that update, I actually get an error:
```
module.ocp_all_inclusive.module.ocp_base.ibm_container_addons.addons: Modifying... [id=cicu0mmr021nefhes3dg]
╷
│ Error: Request failed with status code: 409, ServerErrorResponse: {"incidentID":"c7bea872-cf41-429a-915e-8de4257b8039","code":"E4d8b","description":"An add-on with the same name already exists. To update your existing add-on to the latest version, see 'http://ibm.biz/addon-update'.","type":"Provisioning"}
│
│   with module.ocp_all_inclusive.module.ocp_base.ibm_container_addons.addons,
│   on .terraform/modules/ocp_all_inclusive.ocp_base/main.tf line 360, in resource "ibm_container_addons" "addons":
│  360: resource "ibm_container_addons" "addons" {
```